<<<<<<< Upstream, based on master
Процедура ПроверкаИзменений(СтруктураИзменений)
	
	Если СтруктураИзменений.Свойство("ПроверкаИзменений") Тогда
		
		Если СтруктураИзменений.ПроверкаИзменений Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураИзменений.Вставить("ПроверкаИзменений", Истина);
=======
Процедура ПроверкаИзменений(МассивАтрибутов)
	
	Для Каждого Элемент Из МассивАтрибутов Цикл
		Если Элемент.Значение <> Элемент.ПредыдущееЗначение Тогда
			Элемент.Изменен = Истина;
			Элемент.ПредыдущееЗначение = Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
>>>>>>> 8f72e60 Заполнение процедуры
	
КонецПроцедуры

